# specify a directory to install
cask_args appdir: '/Applications'

# install packages
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "buo/cask-upgrade"
tap "jandedobbeleer/oh-my-posh"

brew 'git'
brew 'node'
brew 'wget'
brew "dialog"
brew "gnutls"
brew "jq"
brew "mas"
brew "nmap"
brew "openconnect"
brew "pyenv"
brew "python@3.11"
brew "rsync"
brew "tmux"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "btop"
brew "neofetch"
brew "tailscale"

# Casks
cask 'google-chrome'
cask 'roon'
cask 'slack'
cask 'iterm2'
cask "chromedriver"
cask "miniforge"
cask "mounty"
cask "rar"
cask "bambu-studio"
cask "obsidian"
cask "omnioutliner"
cask "warp"
cask "visual-studio-code"

# App Store Apps
mas "Disk Speed Test", id: 425264550
mas "Focus To-Do", id: 1258530160
mas "Logic Pro", id: 634148309
mas "Microsoft Remote Desktop", id: 1295203466
mas "OmniPlan", id: 1460319993
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Steam Link", id: 1246969117
mas "Tailscale", id: 1475387142
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
